In [1]:
load_ext sql

In [2]:
sql sqlite:///data_set.db

# Pruducts Tablosundaki CategoryID lerin yani kotegorilerin isimleir nelerdir

In [3]:
%sql SELECT * FROM Products LIMIT 2;

 * sqlite:///data_set.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)]

In [4]:
%sql SELECT * FROM Categories LIMIT 2;

 * sqlite:///data_set.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings')]

In [5]:
%%sql
SELECT Products.CategoryID, Categories.CategoryName  FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 10;

 * sqlite:///data_set.db
Done.

[(1, 'Beverages'),
 (1, 'Beverages'),
 (2, 'Condiments'),
 (2, 'Condiments'),
 (2, 'Condiments'),
 (2, 'Condiments'),
 (7, 'Produce'),
 (2, 'Condiments'),
 (6, 'Meat/Poultry'),
 (8, 'Seafood')]

# Beverages Ürün kategorisinin Fiyat Ortalaması Nedir?

In [6]:
%%sql
SELECT AVG(Price) FROM Products LEFT OUTER JOIN Categories ON Products.CategoryID = Categories.CategoryID WHERE CategoryName = "Beverages";

 * sqlite:///data_set.db
Done.

[(42.75,)]

# USA'de Yaşayan Müşteriden Kazanılan Toplam Kazancını bulunuz :)

In [7]:
%sql SELECT name FROM sqlite_master WHERE type="table";

 * sqlite:///data_set.db
Done.

[('Categories',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Products',),
 ('Shippers',),
 ('Suppliers',),
 ('new_table',)]

In [8]:
%sql SELECT * FROM Customers LIMIT 2;

 * sqlite:///data_set.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')]

In [9]:
%sql SELECT * FROM Orders LIMIT 2;

 * sqlite:///data_set.db
Done.

[(10248, 90, 5, '4.07.1996', 3), (10249, 81, 6, '5.07.1996', 1)]

In [10]:
%sql SELECT * FROM OrderDetails LIMIT 2;

 * sqlite:///data_set.db
Done.

[(1, 10248, 11, 12), (2, 10248, 42, 10)]

In [11]:
%sql SELECT * FROM Products LIMIT 2;

 * sqlite:///data_set.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)]

In [12]:
# customer ulke ve customer ıd ->orderstan custemer ıd ile orderıd orderıd -> order detaiilstan pruductıd -> productdan da price

In [24]:
%%sql
SELECT SUM(Price)
FROM ProductS P
LEFT JOIN OrderDetails OD ON P.ProductID = OD.ProductId
LEFT JOIN Orders O ON OD.OrderID = O.OrderID
LEFT JOIN Customers C ON O.CustomerID = O.CustomerID
WHERE C.Country = 'USA';

 * sqlite:///data_set.db
Done.

[(306891,)]

# Products Tablosundaki CategoryID lerin isimlerinini ve Her Birinin Ortalama Fiyatlarını Bulunuz

In [26]:
%sql SELECT * FROM Products LIMIT 2;

 * sqlite:///data_set.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19)]

In [27]:
%sql SELECT * FROM Categories LIMIT 2;

 * sqlite:///data_set.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings')]

In [34]:
%%sql
SELECT P.CategoryID, C.CategoryName, AVG(P.Price) 
FROM Products P
LEFT JOIN Categories C ON P.CategoryID = C.CategoryID
GROUP BY  C.CategoryName;

 * sqlite:///data_set.db
Done.

[(1, 'Beverages', 42.75),
 (2, 'Condiments', 28.25),
 (3, 'Confections', 33.76923076923077),
 (4, 'Dairy Products', 74.9),
 (5, 'Grains/Cereals', 23.571428571428573),
 (6, 'Meat/Poultry', 55.166666666666664),
 (7, 'Produce', 32.2),
 (8, 'Seafood', 26.5)]

# Çalışanları İsimleriyle Birlikte Yaptıkları Toplam Stışa Göre Sıralayınız

In [42]:
%sql SELECT * FROM Employees LIMIT 2;

 * sqlite:///data_set.db
Done.

[(1, 'Davolio', 'Nancy', '8.12.1968', 'EmpID1.pic', "Education includes a BA in psychology from Colorado State University. She also completed (The Art of the Cold Call). Nancy is a member of 'Toastmasters International'."),
 (2, 'Fuller', 'Andrew', '19.02.1952', 'EmpID2.pic', 'Andrew received his BTS commercial and a Ph.D. in international marketing from the University of Dallas. He is fluent in French and Italian and reads ... (113 characters truncated) ... resident of sales. Andrew is a member of the Sales Management Roundtable, the Seattle Chamber of Commerce, and the Pacific Rim Importers Association.')]

In [57]:
%%sql
SELECT E.FirstName, E.LastName, SUM(P.Price) sum_sell
FROM Products P
LEFT JOIN OrderDetails OD ON P.ProductID = OD.ProductID
LEFT JOIN Orders O ON OD.OrderID = O.OrderID
LEFT JOIN Employees E ON O.EmployeeId = E.EmployeeID
GROUP BY O.EmployeeID
ORDER BY sum_sell DESC;

 * sqlite:///data_set.db
Done.

[('Margaret', 'Peacock', 5515),
 ('Nancy', 'Davolio', 4353),
 ('Janet', 'Leverling', 3048),
 ('Michael', 'Suyama', 2981),
 ('Laura', 'Callahan', 2380),
 ('Robert', 'King', 1852),
 ('Andrew', 'Fuller', 1550),
 ('Steven', 'Buchanan', 1408),
 ('Anne', 'Dodsworth', 520)]